"""
Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
до минуты: <s> сек;
до часа: <m> мин <s> сек;
до суток: <h> час <m> мин <s> сек;
* в остальных случаях: <d> дн <h> час <m> мин <s> сек.

"""
duration = [53, 120, 153, 2475, 4153, 400153, 634126]

for sec in duration:
    if sec < 60:
        print(sec, 'сек')
    elif sec < 3600:
        print(f'{sec // 60} мин {sec % 60} сек')
    elif sec < 86400:
        print(f'{sec // 3600} час {sec % 3600 // 60} мин {sec % 3600 % 60} сек')
    else:
        day = sec // 86400
        temp = sec % 86400
        print(f'{day} дн {temp // 3600} час {temp % 3600 // 60} мин {temp % 3600 % 60} сек')
